Classes | Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::DuctRectangularSegmentPreferenceTable Class Referencefinal
MEP Element Manager
The DuctRectangularSegmentPreferenceTable represents a named entity, that contains rows that consists of a size and a description. The rows have to be unique by value and are always in ascending order. More...
#include <MEPDuctRectangularSegmentPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::DuctRectangularSegmentPreferenceTable:
 Classes
class  | Modifier
Modifier of the DuctRectangularSegmentPreferenceTable. More...
 Public Member Functions
bool  | Exists () const
Result< void >  | IsEditable () const
Checks whether the table is editable.
GS::UniString  | GetName () const
uint32_t  | GetSize () const
Result< double >  | GetValue (uint32_t index) const
Result< GS::UniString >  | GetDescription (uint32_t index) const
bool  | GetUseIndividualSegmentLengths () const
Returns whether the rigid segment segmentation is turned on. If this is false, there will be only one rigid segment for each routing segment, and the minimum and maximum segmentation lengths are ignored when generating routings.
double  | GetMinimumSegmentationLength () const
double  | GetMaximumSegmentationLength () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< DuctRectangularSegmentPreferenceTable >  | Get (const UniqueID &uniqueId)
Returns a DuctRectangularSegmentPreferenceTable.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The DuctRectangularSegmentPreferenceTable represents a named entity, that contains rows that consists of a size and a description. The rows have to be unique by value and are always in ascending order.
Since
Archicad 28
Example code snippet from Test / New MEP
Getters
 for (const UniqueID& ductSegmentTableId : ductSegmentTableIds) {
 ACAPI::Result<DuctRectangularSegmentPreferenceTable> ductRectangularSegmentTable = DuctRectangularSegmentPreferenceTable::Get (ductSegmentTableId);
 if (ductRectangularSegmentTable.IsErr ())
 continue;
 preferenceReporter.SetTabCount (2);
 preferenceReporter.Add ("Preference name", ductRectangularSegmentTable->GetName ());
 preferenceReporter.Add ("Rectangular table:");
 for (uint32_t i = 0; i < ductRectangularSegmentTable->GetSize (); ++i) {
 preferenceReporter.SetTabCount (3);
 preferenceReporter.Add ("Value", *ductRectangularSegmentTable->GetValue (i), false);
 preferenceReporter.SetTabCount (0);
 preferenceReporter.Add (", ", false);
 GS::UniString description = *ductRectangularSegmentTable->GetDescription (i);
 preferenceReporter.Add ("Description", description == GS::EmptyUniString ? "Empty" : description);
 }
 preferenceReporter.AddNewLine ();
 ACAPI::Result<DuctCircularSegmentPreferenceTable> ductCircularSegmentTable = DuctCircularSegmentPreferenceTable::Get (ductSegmentTableId);
 if (ductCircularSegmentTable.IsErr ())
 continue;
 preferenceReporter.SetTabCount (2);
 preferenceReporter.Add ("Circular table:");
 for (uint32_t i = 0; i < ductCircularSegmentTable->GetSize (); ++i) {
 preferenceReporter.SetTabCount (3);
 preferenceReporter.Add ("ReferenceId", *ductCircularSegmentTable->GetReferenceId (i), false);
 preferenceReporter.SetTabCount (0);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Diameter", *ductCircularSegmentTable->GetDiameter (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Wall Thickness", *ductCircularSegmentTable->GetWallThickness (i), false);
 preferenceReporter.Add (", ", false);
 GS::UniString description = *ductCircularSegmentTable->GetDescription (i);
 preferenceReporter.Add ("Description", description == GS::EmptyUniString ? "Empty" : description, false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add (*ductCircularSegmentTable->IsRowValid (i) ? "Row is valid" : "Row is not valid");
 }
 preferenceReporter.AddNewLine ();
 }
 Modification
 std::vector<UniqueID> tableIds = container->GetPreferenceTables ();
 preferenceReporter.Add ("Deleting the first row of every shape of every duct table.");
 for (const UniqueID& uniqueId : tableIds) {
 ACAPI::Result<DuctRectangularSegmentPreferenceTable> rectangularTable = DuctRectangularSegmentPreferenceTable::Get (uniqueId);
 if (rectangularTable.IsErr ())
 continue;
 preferenceReporter.Add ("Trying to delete from", rectangularTable->GetName ());
 rectangularTable->Modify ([&](DuctRectangularSegmentPreferenceTable::Modifier& modifier) {
 preferenceReporter.SetTabCount (1);
 ACAPI::Result<void> rDeleteResult = modifier.Delete (0);
 if (rDeleteResult.IsOk ())
 preferenceReporter.Add ("Deletion of the first element from rectangular sizes was successful.");
 else
 preferenceReporter.Add ("Deletion unsuccessful", GS::UniString (rDeleteResult.UnwrapErr ().text));
 }, "Delete from rectangular preference table.");
 preferenceReporter.Add ("Trying make it segmented", rectangularTable->GetName ());
 rectangularTable->Modify ([&](DuctRectangularSegmentPreferenceTable::Modifier& modifier) {
 modifier.SetUseIndividualSegmentLengths (true);
 if (modifier.SetSegmentationLengths (0.1, 1.0).IsOk ())
 preferenceReporter.Add ("Segmentation was successful.");
 else
 preferenceReporter.Add ("Segmentation unsuccessful");
 }, "Making it a segmented preference table");
 ACAPI::Result<DuctCircularSegmentPreferenceTable> circularTable = DuctCircularSegmentPreferenceTable::Get (uniqueId);
 if (circularTable.IsErr ())
 continue;
 uint32_t firstValidRowIndex = 0;
 for (uint32_t i = 0; i < circularTable->GetSize (); ++i) {
 if (*circularTable->IsRowValid (i)) {
 firstValidRowIndex = i;
 break;
 }
 }
 preferenceReporter.Add ("Trying to empty the first valid row of", circularTable->GetName ());
 circularTable->Modify ([&](DuctCircularSegmentPreferenceTable::Modifier& modifier) {
 preferenceReporter.SetTabCount (1);
 ACAPI::Result<void> cDeleteResult = modifier.EmptyRow (firstValidRowIndex);
 if (cDeleteResult.IsOk ())
 preferenceReporter.Add ("Deletion of the first element from circular sizes was successful.");
 else
 preferenceReporter.Add ("Deletion unsuccessful", GS::UniString (cDeleteResult.UnwrapErr ().text));
 }, "Delete from circular preference table.");
 preferenceReporter.SetTabCount (0);
 }
Member Function Documentation
◆ Exists()
 bool ACAPI::MEP::DuctRectangularSegmentPreferenceTable::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ Get()
 static Result< DuctRectangularSegmentPreferenceTable > ACAPI::MEP::DuctRectangularSegmentPreferenceTable::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a DuctRectangularSegmentPreferenceTable.
Parameters
uniqueId | The UniqueID of the requested DuctRectangularSegmentPreferenceTable.
Returns
If the uniqueId belongs to a DuctRectangularSegmentPreferenceTable, returns the object associated to it, otherwise Error.
◆ GetDescription()
 Result< GS::UniString > ACAPI::MEP::DuctRectangularSegmentPreferenceTable::GetDescription  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is not defined for the DuctRectangularSegmentPreferenceTable, otherwise returns the description of a table's row.
◆ GetMaximumSegmentationLength()
 double ACAPI::MEP::DuctRectangularSegmentPreferenceTable::GetMaximumSegmentationLength  |  ( |   | ) |   const
Returns
Returns the maximum segmentation length of the rigid segment. If the segmentation is turned off, the value is ignored when generating routings, and the rigid segment will be the same length as the routing segment.
◆ GetMinimumSegmentationLength()
 double ACAPI::MEP::DuctRectangularSegmentPreferenceTable::GetMinimumSegmentationLength  |  ( |   | ) |   const
Returns
Returns the minimum segmentation length of the rigid segment. If the segmentation is turned off, the value is ignored when generating routings, and the rigid segment will be the same length as the routing segment.
◆ GetName()
 GS::UniString ACAPI::MEP::DuctRectangularSegmentPreferenceTable::GetName  |  ( |   | ) |   const
Returns
Returns the name of the table.
◆ GetSize()
 uint32_t ACAPI::MEP::DuctRectangularSegmentPreferenceTable::GetSize  |  ( |   | ) |   const
Returns
Returns the size of the table.
◆ GetUseIndividualSegmentLengths()
 bool ACAPI::MEP::DuctRectangularSegmentPreferenceTable::GetUseIndividualSegmentLengths  |  ( |   | ) |   const
Returns whether the rigid segment segmentation is turned on. If this is false, there will be only one rigid segment for each routing segment, and the minimum and maximum segmentation lengths are ignored when generating routings.
Returns
Returns true if the rigid segment segmentation is turned on, and false if it's turned off.
◆ GetValue()
 Result< double > ACAPI::MEP::DuctRectangularSegmentPreferenceTable::GetValue  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is not defined for the DuctRectangularSegmentPreferenceTable, otherwise returns the value of a table's row.
◆ IsEditable()
 Result< void > ACAPI::MEP::DuctRectangularSegmentPreferenceTable::IsEditable  |  ( |   | ) |   const
Checks whether the table is editable.
Returns
Returns nothing if the table is editable, otherwise the error code and error message containing information about the reason.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::DuctRectangularSegmentPreferenceTable::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.